## **Pandas:**

In [122]:
import numpy as np
import pandas as pd

In [123]:
dict={'Name':['Aqeel','Ali','Awais'],
      'Marks':[70,62,80],
      'City':['Musa Khel','Marmandi','Mianwali']}

In [124]:
df=pd.DataFrame(dict)

In [125]:
df

    Name  Marks       City
0  Aqeel     70  Musa Khel
1    Ali     62   Marmandi
2  Awais     80   Mianwali

In [126]:
df.to_csv('mydata.csv')

**If you don't want indexes in your csv file while saving dataframes in it.**

In [127]:
df.to_csv("no_index.csv",index=False)

In [128]:
df.head(2)

    Name  Marks       City
0  Aqeel     70  Musa Khel
1    Ali     62   Marmandi

In [129]:
df.tail(2)

    Name  Marks      City
1    Ali     62  Marmandi
2  Awais     80  Mianwali

describe()  apply some statistic on out numerical columns

In [130]:
df.describe()

           Marks
count   3.000000
mean   70.666667
std     9.018500
min    62.000000
25%    66.000000
50%    70.000000
75%    75.000000
max    80.000000

In [131]:
train=pd.read_csv('Train.csv')

In [132]:
train

   Train no  Speed       City
0      3424     60  Musa Khel
1      7453     75   Marmandi
2      3452     97   Mianwali

**Getting specific column**

In [133]:
train['Speed']

0    60
1    75
2    97
Name: Speed, dtype: int64

In [134]:
train['Train no']

0    3424
1    7453
2    3452
Name: Train no, dtype: int64

In [135]:
train['City']

0    Musa Khel
1     Marmandi
2     Mianwali
Name: City, dtype: object

In [136]:
train['Speed'][0]

60

In [137]:
train['Speed'][0]=60

C:\Users\This PC\AppData\Local\Temp\ipykernel_6476\3611316110.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['Speed'][0]=60

In [138]:
train

   Train no  Speed       City
0      3424     60  Musa Khel
1      7453     75   Marmandi
2      3452     97   Mianwali

In [139]:
train.to_csv('Train.csv',index=False)

In [140]:
train.index=['first','second','third'] #changing the names of the index

In [141]:
train

        Train no  Speed       City
first       3424     60  Musa Khel
second      7453     75   Marmandi
third       3452     97   Mianwali

**But the best way is to index name should numbers and columns have their own names**

In [142]:
train.index=[0,1,2] #indexes should equal to the total numbers of rows

In [143]:
train

   Train no  Speed       City
0      3424     60  Musa Khel
1      7453     75   Marmandi
2      3452     97   Mianwali

In [144]:
train['Train no'].max()

7453

**Panda series**

In [145]:
ser= pd.Series([1,2,3,4,5])

In [146]:
ser #series are like our columns

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [147]:
ser=pd.Series(np.random.randint(np.arange(1,6)))

In [148]:
type(ser)

pandas.core.series.Series

In [149]:
ser

0    0
1    0
2    2
3    0
4    3
dtype: int32

**New dataframe**

In [150]:
newdf=pd.DataFrame(np.random.rand(334,5))

In [151]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.488012    0.503184    0.476156    0.501345    0.507616
std      0.269750    0.301042    0.277147    0.295781    0.285147
min      0.001751    0.003791    0.014813    0.002802    0.003556
25%      0.280255    0.232203    0.242642    0.237723    0.274103
50%      0.495361    0.507391    0.459945    0.518300    0.549148
75%      0.701642    0.764816    0.713453    0.765173    0.741264
max      0.997988    0.998686    0.998167    0.999286    0.996575

In [152]:
newdf.info

<bound method DataFrame.info of             0         1         2         3         4
0    0.761896  0.992037  0.970444  0.388839  0.991661
1    0.537061  0.369353  0.815880  0.611399  0.376320
2    0.812868  0.452920  0.388345  0.074300  0.564708
3    0.441285  0.862606  0.668626  0.678420  0.161843
4    0.080405  0.689312  0.194074  0.604543  0.740716
..        ...       ...       ...       ...       ...
329  0.337686  0.930909  0.736689  0.680936  0.805624
330  0.076420  0.281268  0.724187  0.070705  0.294110
331  0.765668  0.673129  0.966068  0.885469  0.367636
332  0.474802  0.566986  0.046846  0.682673  0.694738
333  0.196133  0.507601  0.626752  0.081347  0.004299

[334 rows x 5 columns]>

In [153]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [154]:
newdf

            0         1         2         3         4
0    0.761896  0.992037  0.970444  0.388839  0.991661
1    0.537061  0.369353  0.815880  0.611399  0.376320
2    0.812868  0.452920  0.388345  0.074300  0.564708
3    0.441285  0.862606  0.668626  0.678420  0.161843
4    0.080405  0.689312  0.194074  0.604543  0.740716
..        ...       ...       ...       ...       ...
329  0.337686  0.930909  0.736689  0.680936  0.805624
330  0.076420  0.281268  0.724187  0.070705  0.294110
331  0.765668  0.673129  0.966068  0.885469  0.367636
332  0.474802  0.566986  0.046846  0.682673  0.694738
333  0.196133  0.507601  0.626752  0.081347  0.004299

[334 rows x 5 columns]

In [155]:
newdf[0][0]='Aqeel'

C:\Users\This PC\AppData\Local\Temp\ipykernel_6476\3688238585.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Aqeel' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]='Aqeel'

In [156]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [157]:
newdf.index

RangeIndex(start=0, stop=334, step=1)

In [158]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [159]:
#narr=np.array(newdf)  same as below
#narr

In [160]:
newdf.to_numpy()

array([['Aqeel', 0.992037452547358, 0.9704435108875563,
        0.388838864557991, 0.9916605591570963],
       [0.5370611938552184, 0.36935268938612786, 0.8158795299196718,
        0.611399204847763, 0.3763198450905494],
       [0.8128683031934656, 0.4529203764672489, 0.3883447118780964,
        0.07430006121485466, 0.564708378843645],
       ...,
       [0.7656680574041872, 0.6731292587064018, 0.9660678312878103,
        0.8854687268236326, 0.3676360108375333],
       [0.47480190888114615, 0.5669859375782172, 0.046846113451273874,
        0.6826734154710619, 0.6947377463386525],
       [0.19613327832675342, 0.5076010623617415, 0.6267519624222722,
        0.08134745983397773, 0.0042986303495148315]], dtype=object)

In [161]:
newdf[0][0]=.42343

In [162]:
newdf

            0         1         2         3         4
0     0.42343  0.992037  0.970444  0.388839  0.991661
1    0.537061  0.369353  0.815880  0.611399  0.376320
2    0.812868  0.452920  0.388345  0.074300  0.564708
3    0.441285  0.862606  0.668626  0.678420  0.161843
4    0.080405  0.689312  0.194074  0.604543  0.740716
..        ...       ...       ...       ...       ...
329  0.337686  0.930909  0.736689  0.680936  0.805624
330   0.07642  0.281268  0.724187  0.070705  0.294110
331  0.765668  0.673129  0.966068  0.885469  0.367636
332  0.474802  0.566986  0.046846  0.682673  0.694738
333  0.196133  0.507601  0.626752  0.081347  0.004299

[334 rows x 5 columns]

In [163]:
newdf.to_numpy()

array([[0.42343, 0.992037452547358, 0.9704435108875563,
        0.388838864557991, 0.9916605591570963],
       [0.5370611938552184, 0.36935268938612786, 0.8158795299196718,
        0.611399204847763, 0.3763198450905494],
       [0.8128683031934656, 0.4529203764672489, 0.3883447118780964,
        0.07430006121485466, 0.564708378843645],
       ...,
       [0.7656680574041872, 0.6731292587064018, 0.9660678312878103,
        0.8854687268236326, 0.3676360108375333],
       [0.47480190888114615, 0.5669859375782172, 0.046846113451273874,
        0.6826734154710619, 0.6947377463386525],
       [0.19613327832675342, 0.5076010623617415, 0.6267519624222722,
        0.08134745983397773, 0.0042986303495148315]], dtype=object)

In [164]:
newdf.T #transpose of the data frame

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.42343,0.537061,0.812868,0.441285,0.080405,0.119521,0.25941,0.553447,0.33034,0.426375,...,0.684207,0.970611,0.541285,0.95821,0.634895,0.337686,0.07642,0.765668,0.474802,0.196133
1,0.992037,0.369353,0.45292,0.862606,0.689312,0.109382,0.554595,0.451955,0.893192,0.209881,...,0.519025,0.323212,0.94789,0.711026,0.48103,0.930909,0.281268,0.673129,0.566986,0.507601
2,0.970444,0.81588,0.388345,0.668626,0.194074,0.168092,0.262283,0.660643,0.499563,0.637167,...,0.033509,0.462716,0.536612,0.67282,0.724562,0.736689,0.724187,0.966068,0.046846,0.626752
3,0.388839,0.611399,0.0743,0.67842,0.604543,0.214529,0.54278,0.279504,0.459992,0.080047,...,0.392771,0.077026,0.633109,0.25257,0.785365,0.680936,0.070705,0.885469,0.682673,0.081347
4,0.991661,0.37632,0.564708,0.161843,0.740716,0.180243,0.788287,0.795743,0.169758,0.160045,...,0.996575,0.392748,0.962204,0.554969,0.258388,0.805624,0.29411,0.367636,0.694738,0.004299

In [165]:
newdf.head()

          0         1         2         3         4
0   0.42343  0.992037  0.970444  0.388839  0.991661
1  0.537061  0.369353  0.815880  0.611399  0.376320
2  0.812868  0.452920  0.388345  0.074300  0.564708
3  0.441285  0.862606  0.668626  0.678420  0.161843
4  0.080405  0.689312  0.194074  0.604543  0.740716

In [166]:
newdf.sort_index(axis=0,ascending=False) #sorted in descending oreder

            0         1         2         3         4
333  0.196133  0.507601  0.626752  0.081347  0.004299
332  0.474802  0.566986  0.046846  0.682673  0.694738
331  0.765668  0.673129  0.966068  0.885469  0.367636
330   0.07642  0.281268  0.724187  0.070705  0.294110
329  0.337686  0.930909  0.736689  0.680936  0.805624
..        ...       ...       ...       ...       ...
4    0.080405  0.689312  0.194074  0.604543  0.740716
3    0.441285  0.862606  0.668626  0.678420  0.161843
2    0.812868  0.452920  0.388345  0.074300  0.564708
1    0.537061  0.369353  0.815880  0.611399  0.376320
0     0.42343  0.992037  0.970444  0.388839  0.991661

[334 rows x 5 columns]

In [167]:
newdf[4]

0      0.991661
1      0.376320
2      0.564708
3      0.161843
4      0.740716
         ...
329    0.805624
330    0.294110
331    0.367636
332    0.694738
333    0.004299
Name: 4, Length: 334, dtype: float64

In [168]:
type(newdf[4])

pandas.core.series.Series

**View and copy in pandas dataframes**

In [169]:
newdf2=newdf #it is not copy it is a view of newdf

In [170]:
newdf2

            0         1         2         3         4
0     0.42343  0.992037  0.970444  0.388839  0.991661
1    0.537061  0.369353  0.815880  0.611399  0.376320
2    0.812868  0.452920  0.388345  0.074300  0.564708
3    0.441285  0.862606  0.668626  0.678420  0.161843
4    0.080405  0.689312  0.194074  0.604543  0.740716
..        ...       ...       ...       ...       ...
329  0.337686  0.930909  0.736689  0.680936  0.805624
330   0.07642  0.281268  0.724187  0.070705  0.294110
331  0.765668  0.673129  0.966068  0.885469  0.367636
332  0.474802  0.566986  0.046846  0.682673  0.694738
333  0.196133  0.507601  0.626752  0.081347  0.004299

[334 rows x 5 columns]

In [171]:
newdf2[0][0]=1111 #it will change in orignal newdf bcz it is view not a copy

In [172]:
newdf #so it changed through view

            0         1         2         3         4
0        1111  0.992037  0.970444  0.388839  0.991661
1    0.537061  0.369353  0.815880  0.611399  0.376320
2    0.812868  0.452920  0.388345  0.074300  0.564708
3    0.441285  0.862606  0.668626  0.678420  0.161843
4    0.080405  0.689312  0.194074  0.604543  0.740716
..        ...       ...       ...       ...       ...
329  0.337686  0.930909  0.736689  0.680936  0.805624
330   0.07642  0.281268  0.724187  0.070705  0.294110
331  0.765668  0.673129  0.966068  0.885469  0.367636
332  0.474802  0.566986  0.046846  0.682673  0.694738
333  0.196133  0.507601  0.626752  0.081347  0.004299

[334 rows x 5 columns]

In [173]:
newdf=newdf2.copy() #now it will work as copy

In [174]:
newdf2[0][0]=222

C:\Users\This PC\AppData\Local\Temp\ipykernel_6476\4208072237.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=222

In [175]:
newdf2.head()

          0         1         2         3         4
0       222  0.992037  0.970444  0.388839  0.991661
1  0.537061  0.369353  0.815880  0.611399  0.376320
2  0.812868  0.452920  0.388345  0.074300  0.564708
3  0.441285  0.862606  0.668626  0.678420  0.161843
4  0.080405  0.689312  0.194074  0.604543  0.740716

In [176]:
newdf.head() #now after change in copy we can see orignal is not change

          0         1         2         3         4
0      1111  0.992037  0.970444  0.388839  0.991661
1  0.537061  0.369353  0.815880  0.611399  0.376320
2  0.812868  0.452920  0.388345  0.074300  0.564708
3  0.441285  0.862606  0.668626  0.678420  0.161843
4  0.080405  0.689312  0.194074  0.604543  0.740716

**So due to these reasons we use loc() to change our values**

In [177]:
newdf.loc[0,0]=2343

In [178]:
newdf.head()

          0         1         2         3         4
0      2343  0.992037  0.970444  0.388839  0.991661
1  0.537061  0.369353  0.815880  0.611399  0.376320
2  0.812868  0.452920  0.388345  0.074300  0.564708
3  0.441285  0.862606  0.668626  0.678420  0.161843
4  0.080405  0.689312  0.194074  0.604543  0.740716

In [179]:
newdf.columns=list('ABCDE')

In [180]:
newdf.head(2)

          A         B         C         D         E
0      2343  0.992037  0.970444  0.388839  0.991661
1  0.537061  0.369353  0.815880  0.611399  0.376320

In [181]:
newdf.loc[0,'A']=12345

In [182]:
newdf.head(2)

          A         B         C         D         E
0     12345  0.992037  0.970444  0.388839  0.991661
1  0.537061  0.369353  0.815880  0.611399  0.376320

In [183]:
newdf.loc[0,0]=6666 #it makes an extra col named 0 bcz there is no column 0 to update so it make new

In [184]:
newdf.head()

          A         B         C         D         E       0
0     12345  0.992037  0.970444  0.388839  0.991661  6666.0
1  0.537061  0.369353  0.815880  0.611399  0.376320     NaN
2  0.812868  0.452920  0.388345  0.074300  0.564708     NaN
3  0.441285  0.862606  0.668626  0.678420  0.161843     NaN
4  0.080405  0.689312  0.194074  0.604543  0.740716     NaN

In [185]:
newdf=newdf.drop(0,axis=1)

In [186]:
newdf

            A         B         C         D         E
0       12345  0.992037  0.970444  0.388839  0.991661
1    0.537061  0.369353  0.815880  0.611399  0.376320
2    0.812868  0.452920  0.388345  0.074300  0.564708
3    0.441285  0.862606  0.668626  0.678420  0.161843
4    0.080405  0.689312  0.194074  0.604543  0.740716
..        ...       ...       ...       ...       ...
329  0.337686  0.930909  0.736689  0.680936  0.805624
330   0.07642  0.281268  0.724187  0.070705  0.294110
331  0.765668  0.673129  0.966068  0.885469  0.367636
332  0.474802  0.566986  0.046846  0.682673  0.694738
333  0.196133  0.507601  0.626752  0.081347  0.004299

[334 rows x 5 columns]

**If need specific row and columns**

In [187]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.815880  0.611399
2  0.388345  0.074300

In [188]:
newdf.loc[[1,2],['C','D']]=1 #also you can change values at these positions

In [189]:
newdf

            A         B         C         D         E
0       12345  0.992037  0.970444  0.388839  0.991661
1    0.537061  0.369353  1.000000  1.000000  0.376320
2    0.812868  0.452920  1.000000  1.000000  0.564708
3    0.441285  0.862606  0.668626  0.678420  0.161843
4    0.080405  0.689312  0.194074  0.604543  0.740716
..        ...       ...       ...       ...       ...
329  0.337686  0.930909  0.736689  0.680936  0.805624
330   0.07642  0.281268  0.724187  0.070705  0.294110
331  0.765668  0.673129  0.966068  0.885469  0.367636
332  0.474802  0.566986  0.046846  0.682673  0.694738
333  0.196133  0.507601  0.626752  0.081347  0.004299

[334 rows x 5 columns]

In [190]:
newdf.loc[:,['C','D']] #all rows C D columns

            C         D
0    0.970444  0.388839
1    1.000000  1.000000
2    1.000000  1.000000
3    0.668626  0.678420
4    0.194074  0.604543
..        ...       ...
329  0.736689  0.680936
330  0.724187  0.070705
331  0.966068  0.885469
332  0.046846  0.682673
333  0.626752  0.081347

[334 rows x 2 columns]

In [191]:
newdf.loc[[1,2],:] #all columns 1,2 rows

          A         B    C    D         E
1  0.537061  0.369353  1.0  1.0  0.376320
2  0.812868  0.452920  1.0  1.0  0.564708

**Quries running in DataFrames**

In [192]:
newdf.loc[(newdf["A"]<0.3)]

            A         B         C         D         E
4    0.080405  0.689312  0.194074  0.604543  0.740716
5    0.119521  0.109382  0.168092  0.214529  0.180243
6     0.25941  0.554595  0.262283  0.542780  0.788287
10    0.19622  0.219233  0.823075  0.854264  0.678912
17   0.257922  0.957340  0.751744  0.963082  0.086807
..        ...       ...       ...       ...       ...
312  0.198884  0.656163  0.866557  0.573761  0.966940
318  0.094069  0.059066  0.916143  0.655619  0.965523
319  0.091622  0.502910  0.909278  0.787957  0.149806
330   0.07642  0.281268  0.724187  0.070705  0.294110
333  0.196133  0.507601  0.626752  0.081347  0.004299

[90 rows x 5 columns]

In [193]:
newdf.loc[(newdf["A"]<0.3) & (newdf['C']>0.9)]

            A         B         C         D         E
32   0.134813  0.138226  0.924923  0.610386  0.476888
153  0.222634  0.211969  0.960748  0.537142  0.100630
196  0.185135  0.385459  0.923874  0.318174  0.040733
204   0.26982  0.337639  0.998167  0.035908  0.610771
241  0.182543  0.386647  0.993063  0.769860  0.182656
264  0.289788  0.679177  0.986074  0.972280  0.615083
268  0.122744  0.171653  0.971116  0.574173  0.683501
309  0.219811  0.762435  0.925535  0.554395  0.433416
318  0.094069  0.059066  0.916143  0.655619  0.965523
319  0.091622  0.502910  0.909278  0.787957  0.149806

**Index loc function iloc()**

In [194]:
newdf.head(2)

          A         B         C         D         E
0     12345  0.992037  0.970444  0.388839  0.991661
1  0.537061  0.369353  1.000000  1.000000  0.376320

In [195]:
newdf.iloc[0,4]

0.9916605591570963

In [196]:
newdf.iloc[[0,1],[1,2]] #here 0,1 row 1,2 column

          B         C
0  0.992037  0.970444
1  0.369353  1.000000

In [197]:
newdf.drop([0])# drop 0 row

            A         B         C         D         E
1    0.537061  0.369353  1.000000  1.000000  0.376320
2    0.812868  0.452920  1.000000  1.000000  0.564708
3    0.441285  0.862606  0.668626  0.678420  0.161843
4    0.080405  0.689312  0.194074  0.604543  0.740716
5    0.119521  0.109382  0.168092  0.214529  0.180243
..        ...       ...       ...       ...       ...
329  0.337686  0.930909  0.736689  0.680936  0.805624
330   0.07642  0.281268  0.724187  0.070705  0.294110
331  0.765668  0.673129  0.966068  0.885469  0.367636
332  0.474802  0.566986  0.046846  0.682673  0.694738
333  0.196133  0.507601  0.626752  0.081347  0.004299

[333 rows x 5 columns]

In [198]:
newdf.drop(['A','C'],axis=1) #column A drop

            B         D         E
0    0.992037  0.388839  0.991661
1    0.369353  1.000000  0.376320
2    0.452920  1.000000  0.564708
3    0.862606  0.678420  0.161843
4    0.689312  0.604543  0.740716
..        ...       ...       ...
329  0.930909  0.680936  0.805624
330  0.281268  0.070705  0.294110
331  0.673129  0.885469  0.367636
332  0.566986  0.682673  0.694738
333  0.507601  0.081347  0.004299

[334 rows x 3 columns]

**Inplace:**
when we use inplace=True then it apply the changes on orignal/modify and no need to write df=df.......for change

In [199]:
newdf.head(2)

          A         B         C         D         E
0     12345  0.992037  0.970444  0.388839  0.991661
1  0.537061  0.369353  1.000000  1.000000  0.376320

In [200]:
newdf.drop(['A'],axis=1,inplace=True) #in our orignal column A is dropped

In [201]:
newdf

            B         C         D         E
0    0.992037  0.970444  0.388839  0.991661
1    0.369353  1.000000  1.000000  0.376320
2    0.452920  1.000000  1.000000  0.564708
3    0.862606  0.668626  0.678420  0.161843
4    0.689312  0.194074  0.604543  0.740716
..        ...       ...       ...       ...
329  0.930909  0.736689  0.680936  0.805624
330  0.281268  0.724187  0.070705  0.294110
331  0.673129  0.966068  0.885469  0.367636
332  0.566986  0.046846  0.682673  0.694738
333  0.507601  0.626752  0.081347  0.004299

[334 rows x 4 columns]

In [202]:
newdf.drop([1,5],axis=0,inplace=True) #in our orignal row 1,5 is dropped

In [203]:
newdf #here our 1,5 row is dropped and now i need to reset the indexes

            B         C         D         E
0    0.992037  0.970444  0.388839  0.991661
2    0.452920  1.000000  1.000000  0.564708
3    0.862606  0.668626  0.678420  0.161843
4    0.689312  0.194074  0.604543  0.740716
6    0.554595  0.262283  0.542780  0.788287
..        ...       ...       ...       ...
329  0.930909  0.736689  0.680936  0.805624
330  0.281268  0.724187  0.070705  0.294110
331  0.673129  0.966068  0.885469  0.367636
332  0.566986  0.046846  0.682673  0.694738
333  0.507601  0.626752  0.081347  0.004299

[332 rows x 4 columns]

In [204]:
newdf.head()

          B         C         D         E
0  0.992037  0.970444  0.388839  0.991661
2  0.452920  1.000000  1.000000  0.564708
3  0.862606  0.668626  0.678420  0.161843
4  0.689312  0.194074  0.604543  0.740716
6  0.554595  0.262283  0.542780  0.788287

In [205]:
newdf.reset_index(drop=True,inplace=True) #it adds a new col index so we need to drop=True

In [206]:
newdf.head()

          B         C         D         E
0  0.992037  0.970444  0.388839  0.991661
1  0.452920  1.000000  1.000000  0.564708
2  0.862606  0.668626  0.678420  0.161843
3  0.689312  0.194074  0.604543  0.740716
4  0.554595  0.262283  0.542780  0.788287

**Null values checking**

In [207]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [208]:
#newdf["B"]=None #Whole B column become none
newdf.loc[:,['B']]=None #Both lines work but loc method is best S

In [209]:
newdf

        B         C         D         E
0    None  0.970444  0.388839  0.991661
1    None  1.000000  1.000000  0.564708
2    None  0.668626  0.678420  0.161843
3    None  0.194074  0.604543  0.740716
4    None  0.262283  0.542780  0.788287
..    ...       ...       ...       ...
327  None  0.736689  0.680936  0.805624
328  None  0.724187  0.070705  0.294110
329  None  0.966068  0.885469  0.367636
330  None  0.046846  0.682673  0.694738
331  None  0.626752  0.081347  0.004299

[332 rows x 4 columns]

In [210]:
newdf['B'].isnull() #now all true because all values of B are none

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

In [211]:
newdf.loc[:,['B']]=34

In [212]:
newdf.head()

    B         C         D         E
0  34  0.970444  0.388839  0.991661
1  34  1.000000  1.000000  0.564708
2  34  0.668626  0.678420  0.161843
3  34  0.194074  0.604543  0.740716
4  34  0.262283  0.542780  0.788287

In [213]:
df=pd.DataFrame({'name':['Ali','Aqeel','Amir'],
                'toy':[np.nan,'Batmobile','Bullwhip'],
                'born':[pd.NaT,pd.Timestamp("15-09-2003"),pd.NaT]})

In [214]:
df

    name        toy       born
0    Ali        NaN        NaT
1  Aqeel  Batmobile 2003-09-15
2   Amir   Bullwhip        NaT

In [215]:
df.dropna() #droping Na values

    name        toy       born
1  Aqeel  Batmobile 2003-09-15

In [216]:
df.dropna(how='all') #it will drop if all values are nan

    name        toy       born
0    Ali        NaN        NaT
1  Aqeel  Batmobile 2003-09-15
2   Amir   Bullwhip        NaT

In [217]:
df2=pd.DataFrame({'name':['Ali','Aqeel','Amir'],
                'toy':[np.nan,np.nan,np.nan],
                'born':[pd.NaT,pd.Timestamp("15-09-2003"),pd.NaT]})

In [218]:
df2

    name  toy       born
0    Ali  NaN        NaT
1  Aqeel  NaN 2003-09-15
2   Amir  NaN        NaT

In [219]:
df2.dropna(how='all',axis=1)

    name       born
0    Ali        NaT
1  Aqeel 2003-09-15
2   Amir        NaT

In [220]:
df3=pd.DataFrame({'name':['Ali','Aqeel','Ali'],
                'toy':[np.nan,np.nan,np.nan],
                'born':[pd.NaT,pd.Timestamp("15-09-2003"),pd.NaT]})

In [221]:
df3

    name  toy       born
0    Ali  NaN        NaT
1  Aqeel  NaN 2003-09-15
2    Ali  NaN        NaT

In [222]:
df3.drop_duplicates(subset=['name'],keep='last' ) #it removes the duplicate names and default it keeps first but i use keep and keep last name

    name  toy       born
1  Aqeel  NaN 2003-09-15
2    Ali  NaN        NaT

In [223]:
df3.dropna(axis=1,inplace=True)

In [224]:
df3

    name
0    Ali
1  Aqeel
2    Ali

In [225]:
df.tail()

    name        toy       born
0    Ali        NaN        NaT
1  Aqeel  Batmobile 2003-09-15
2   Amir   Bullwhip        NaT

In [226]:
df.shape

(3, 3)

In [227]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [228]:
df['name'].value_counts(dropna=False) #Unique values count

name
Ali      1
Aqeel    1
Amir     1
Name: count, dtype: int64

In [229]:
df['toy'].value_counts(dropna=False) #with NA

toy
NaN          1
Batmobile    1
Bullwhip     1
Name: count, dtype: int64

In [230]:
df['toy'].value_counts(dropna=True) #without NA

toy
Batmobile    1
Bullwhip     1
Name: count, dtype: int64

In [231]:
df

    name        toy       born
0    Ali        NaN        NaT
1  Aqeel  Batmobile 2003-09-15
2   Amir   Bullwhip        NaT

In [232]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [233]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

**Quiz**

In [234]:
df=pd.DataFrame({'A':[1,3,6],
                 'B':[4,5,7],
                 })

In [235]:
#Create a dataframe which contains only integers with 3 rows and 2 columns 
#Run following dataframe methods on them:
df.describe()
# df.mean()
# df.corr()
# df.count()
# df.max()
# df.min()
# df.median()
# df.std()
# df.mode()

              A         B
count  3.000000  3.000000
mean   3.333333  5.333333
std    2.516611  1.527525
min    1.000000  4.000000
25%    2.000000  4.500000
50%    3.000000  5.000000
75%    4.500000  6.000000
max    6.000000  7.000000

**Reading Excel Xlsx files**

In [236]:
# pip install openpyxl

In [237]:
data = pd.read_excel('Aqeel.xlsx') #I need to install openpyxl or xlrd

In [238]:
data

    Name  Marks1       City
0  Aqeel      70  Musa Khel
1    Ali      62   Marmandi
2  Awais      80   Mianwali

In [241]:
data = pd.read_excel('Aqeel.xlsx',sheet_name='Sheet1')

In [242]:
data

    Name  Marks1       City
0  Aqeel      70  Musa Khel
1    Ali      62   Marmandi
2  Awais      80   Mianwali

In [240]:
data = pd.read_excel('Aqeel.xlsx',sheet_name='Sheet2')

In [243]:
data

    Name  Marks1       City
0  Aqeel      70  Musa Khel
1    Ali      62   Marmandi
2  Awais      80   Mianwali